AcDbAssocEvaluationCallback.getTransformationType
Allows the custom evaluation callback code to pass information about what
type of transformation (which AutoCAD command) has been performed with
the entities prior to action evaluation. The default implementation
returns kNotSpecified.
Returns:  AcDbAssocTransformationType.

AcDbAssocEvaluationCallback.getAdditionalData
Allows the custom evaluation callback code to pass arbitrary data
to the actions that are being evaluated. The default implementation
returns NULL.
Returns:  Pointer to AcDbEvalContext or NULL.

AcDbAssocEvaluationCallback.cancelActionEvaluation
The custom evaluation callback code can request that the action evaluation
should be cancelled by implementing this callback predicate. The
AcDbAssocAction::evaluate() method checks this predicate just after
issuing the beginActionEvaluation() callback, i.e. just before the action
evaluateOverride() method is called. If a whole associative network is
evaluated, this predicate is also checked after evaluating each action
in the network to see if the network evaluation should continue. Custom
actions can freely add their own calls to check this predicate,
particularly if the action evaluation is time consuming.
Once this predicate returns true, requesting the evaluation to be
cancelled, it should keep returning true, to make sure the evaluation
of the whole associative network is cancelled.
When the evaluation is cancelled, the status of the not-yet evaluated
actions/networks stays unchanged. The status of the actions/networks
that have already been evaluated also stays unchanged, i.e. there is no
roll-back of the already made changes.
This predicate should be used to cancel the evaluation of the whole
associative network, not to selectively control the evaluation of the
individual actions. To selectively enable/disable the evaluation of
individual actions, the beginActionEvaluation() callback can bse used.
Inside this callback the client code can change the status of the action
being evaluated to a status that is not an evaluation request, such as
change it to kSuppressedAssocStatus, kFailedToEvaluateAssocStatus,
kIsUpToDateAssocStatus, and the action is then not going to be evaluated.
Returns:  Returns true iff the evaluation should be cancelled.

AcDbAssocEvaluationCallback.draggingState
The action may inquire the client code whether the evaluation is
happening from inside of the dragging loop and at which stage the
dragging is. The custom evaluation callback code may provide this
information by implementing this callback.
Returns:  Returns the dragging state.

AcDbAssocEvaluationCallback.allDependentActionsMarkedToEvaluate(AcDbAssocNetwork*)
Called during the network evaluation to notify that all actions that need to
be evaluated have been marked to evaluate. This concludes the first phase of
the evaluation process. After this notification all the marked actions are
then sequentially evaluated.
The notification is only issued once, for the top-level network that is being
evaluated, not for the individual subnetworks of the top-level network.
pNetwork:  AcDbAssocNetwork whose all actions that need to
be evaluated have been marked to evaluate.

AcDbAssocEvaluationCallback.endActionEvaluationUsingObject(AcDbAssocAction*,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbObject*)
The action informs that it is done with using or modifying an AcDbObject.
The action issues this callback just before it closes the object. If the
object is a substitute object provided by the client code, the action
does not close it.
pAction:  The action that is being evaluated.
objectId:
The same AcDbObjectId that has been previously passed to the matching
beginActionEvaluationUsingObject() callback.
pObject:
The object that has been used or modified by the action. It may be NULL
if the original object couldn't be opened or if the substitute object
was not of the expected type.

AcDbAssocEvaluationCallback.beginActionEvaluationUsingObject(AcDbAssocAction*,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,System.Boolean,AcDbObject**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The action informs that it is going to use or modify an AcDbObject. The
action issues this callback just before it opens the object for read or
write.
The custom evaluation callback code may pass back a pointer to a
substitute AcDbObject. If it happens, the action should use or modify this
substitute object instead of the original object. The substitute object
is expected to already be correctly open for read or write (if it is a
database-resident object), the action does not need to open or close it.
Also, the substitute object may possibly be a non-database-resident
object and the action should be ok with it.
This allows the custom evaluation callback code to redirect the action
evaluation to use or modify other objects than the action depends on.
A common example is dragging, when the action may be redirected to use
and modify temporary non-database resident clones of the original objects.
The custom evaluation callback code creates non-database resident clones
of any relevant AcDbEnities when notified by the action that the action
is going to modify them, and the action then modifies these temporary
clones. The modified clones are then drawn and discarded, the original
objects remain untouched.
There is an AcDbAssocObjectPointer template class that is
modelled after AcDbObjectPointer template class and that simplifies
the client action evaluation code that needs to perform this redirection.
The AcDbAssocObjectPointer constructor automatically calls
the beginActionEvaluationUsingObject() method and the destructor calls
the endActionEvaluationUsingObject() method. All the client code needs
to do is to use this template class and then use the AcDbObject pointer
this template class provides. The pointer will point either to the
original database-resident object or to the substitute object, if the
evaluation is in progress and the client evaluation callback provided
a substitute object.
pAction:  The action that is being evaluated.
objectId:  The AcDbObject that is going to be used or modified by the action.
objectIsGoingToBeUsed:  The object contents is going to be used.
objectIsGoingToBeModified:  The object contents is going to be modified.
pSubstituteObject:
An AcDbObject optionally provided by the custom evaluation callback code.
The custom evaluation callback code should not assign NULL to this output
argument if it does not want to provide a substitute object. It should
only assign a non-NULL pointer if it intends to provide a substitute object.

AcDbAssocEvaluationCallback.setActionEvaluationErrorStatus(AcDbAssocAction*,Acad.ErrorStatus,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbObject*,System.Void*)
The action informs that an error happened during its evaluation. It does
not need to inform if no error happened. The action may also inform about
which object caused the failure, giving its id, pointer or both, and
provide arbitrary additional info.
pAction:  The action that is being evaluated.
errorStatus:  Action evaluation error status.
objectId:  The failed object id (such as of an AcDbAssocDependency).
pObject:  The failed object pointer (such as of an AcDbAssocDependency).
pErrorInfo:  Additional info about the error.

AcDbAssocEvaluationCallback.endActionEvaluation(AcDbAssocAction*)
The action informs that it has finished its evaluation. This callback
is issued at the end of AcDbAssocAction::evaluate() call
and should not be issued from the individual evaluate() method calls.
The action is open for write when this callback is issued.
pAction:  The action that is being evaluated.

AcDbAssocEvaluationCallback.beginActionEvaluation(AcDbAssocAction*)
The action informs that it is starting its evaluation. This callback
is issued at the beginning of AcDbAssocAction::evaluate() call
and should not be issued from the individual evaluateOverride() method
calls. The action is open for write when this callback is issued.
pAction:  The action that is being evaluated.

AcDbAssocEvaluationCallback.evaluationMode
The action needs to call this method at the beginning of the evaluate()
code to obtain the mode in which it should evaluate itself.
The default implementation returns kModifyObjectsEvaluationMode.
Returns:  The requested evaluation mode.

AcDbAssocEvaluationCallback.Dispose
Virtual destructor.

AcDbAssocEvaluationCallback.#ctor
Default constructor.

AcDbAssocEvaluationCallback
A mechanism for AcDbAssocActions to notify about the progress of evaluation,
to report success or failure, notify about which objects the action is
going to use and modify, to allow the evaluation to be cancelled by the
client, etc.
Pointer to an object of AcDbAssocEvaluationCallback class in a mandatory
argument to the AcDbAssocAction::evaluate() method. AcDbAssocManager manages
an ordered collection of global AcDbAssocEvaluationCallbacks grouped in an
AcDbAssocEvaluationMultiCallback. AcDbAssocManager::evaluateTopLevelNetwork()
passes this multi-callback to the AcDbAssocAction::evaluate() method of the
top-level network.